IC.ДополненияКА/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3b86010-6dc9-4bd6-9fda-850ce2f2ea58">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2daac090-5bc6-4138-93d1-b8a802101e6d">
    <name>ШаблонНаименованияДляПечатиНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="408bd3ed-cb07-4796-a2f4-3f63fc3ff9bd">
    <name>ШаблонРабочегоНаименованияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

IC.ДополненияКА/src/CommonModules/ДКА_РедактированиеШаблоновНаименований/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		

// @strict-types
#Область ПрограммныйИнтерфейс

// Изменение шаблонов наименований.
// 
// Параметры:
//  Аргументы - Структура - Аргументы:
// * ИскомыйТекст - Строка - Искомый текст для замены
// * Замена - Строка - Текст замены
// * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения -
// * ТипНаименования - Строка -
// * УникальныйИдентификатор - УникальныйИдентификатор -
// 
// Возвращаемое значение:
//  Структура - Изменение шаблонов наименований:
// * Всего - Число - Количество обработанных элементов
// * Ошибки - Число - Количество ошибок
Функция ИзменениеШаблоновНаименований(Аргументы) Экспорт

	Итоги = Новый Структура("Всего, Ошибки", 0, 0);
	Счетчик = 1;

	ИмяРеквизита = ?(Аргументы.ТипНаименования = "Рабочее",
					 "ШаблонРабочегоНаименованияНоменклатуры",
					 "ШаблонНаименованияДляПечатиНоменклатуры");

	ТекстЗапроса = "ВЫБРАТЬ
				   |	ВидыНоменклатуры.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
				   |ГДЕ
				   |	ВидыНоменклатуры.ПометкаУдаления = ЛОЖЬ
				   |	И ВидыНоменклатуры.ЭтоГруппа = ЛОЖЬ";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Шаблон", ИмяРеквизита);

	Запрос = Новый Запрос(ТекстЗапроса);
//	Запрос.УстановитьПараметр("Сигнатура", СтрШаблон("%%%1%%", Аргументы.ИскомыйТекст));

	Выборка = Запрос.Выполнить().Выбрать();
	Итоги.Всего = Выборка.Количество();

	Пока Выборка.Следующий() Цикл

		ВидОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//@skip-check invocation-parameter-type-intersect
		ВидОбъект[ИмяРеквизита] = СтрЗаменить(ВидОбъект[ИмяРеквизита], Аргументы.ИскомыйТекст, Аргументы.Замена);

		Попытка
			ВидОбъект.Записать();
			Счетчик = Счетчик + 1;
		Исключение
			Итоги.Ошибки = Итоги.Ошибки + 1;
		КонецПопытки;

		ДлительныеОперации.СообщитьПрогресс(Окр((Счетчик + Итоги.Ошибки) / Итоги.Всего, 0));

	КонецЦикла;

	Возврат Итоги;

КонецФункции

#КонецОбласти
